tutorials/lagrangian/reactingParticleFoam/simplifiedSiwek/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name ignitionCells;
        type cellSet;
        action new;

        source sphereToCell;
        sourceInfo
        {
            centre          (0.125 0.375 0.05);
            radius          0.005;
        }
    }
);


// ************************************************************************* //
